var apikey = "Samir";
module.exports.config = {
    name: "murgi",
    version: "1.0.0",
    author: "Rômeo",
    hasPermssion: 2,
    credits: `${apikey}`,
    description: "আপনি কাকে চুদতে চান এমন 1 জনকে @ম্যানশন করতে হবে ",
    commandCategory: "group",
    usages: "Fire @mention",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.onStart = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("Need to tag 1 user whom you want to start war", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("চুদা লো🤞🏻👅👅");
setTimeout(() => {a({body: "খাংকির পোলা তর মারে চুদি (+)🙊💋 " + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "খাংকির পোলা তর কচি বোন রে চুদি 💋🤣 " + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: " মাদারচোদ তর আম্মু পম পম খাংকির পো😜💔 " + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: " খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু...🔥 " + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: " খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম 😈😍" + " " + name, mentions: arraytag})}, 11000);
setTimeout(() => {a({body: "  depression থেকেও তর মাইরে চু*** দি😈👿" + " " + name, mentions: arraytag})}, 13000);
setTimeout(() => {a({body: "  তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির পোলা🤬" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: " বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় ধোন ডুকামু 🤟💋❤" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  🤝😂💋🤣" + " " + name, mentions: arraytag})}, 19000);
setTimeout(() => {a({body: " উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉😋💋" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: " অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখবি রোমিও তর বাপ মাগির ছেলে 😘💋❤" + " " + name, mentions: arraytag})}, 21500);
setTimeout(() => {a({body: "ভাতিজা শোন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা যা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  💋❤" + " " + name, mentions: arraytag})}, 24000);
setTimeout(() => {a({body: "হাই মাদারচোদ তর তর বেশ্যা জাতের আম্মু টা রে আদর করে করে চুদি 🙊💋😈" + " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body: " ~ চুদা কি আরো খাবি মাগির পোল 🍷😂🤣" + " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body: " খানকির পোলা 🥰💋❤" + " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body: " মাদারচোদ🤣😂💋" + " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body: "  ব্যাস্যার পোলা😂😅" + " " + name, mentions: arraytag})}, 35000);
setTimeout(() => {a({body: " ব্যাশ্যা মাগির পোলা🤣🥳🥳😂" + " " + name, mentions: arraytag})}, 37000);
setTimeout(() => {a({body: "  পতিতা মাগির পোলা 😂😂" + " " + name, mentions: arraytag})}, 40000);
setTimeout(() => {a({body: " Welcome শুয়োরের বাচ্চা 🥰" + " " + name, mentions: arraytag})}, 42000);
setTimeout(() => {a({body: "কুত্তার বাচ্ছা তোর বোনের ভোদায় মাগুর মাছ চাষ করুম😂😂" + " " + name, mentions: arraytag})}, 46000);
setTimeout(() => {a({body: " খাঙ্কিরপোলা পোলা তর বোনের  হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট (+) বস্তির ছেলে তর মায়ের ভুদাতে পোকা💋😂" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "কান্দে ফালাইয়া তর মায়েরে চুদি💋💋" + " " + name, mentions: arraytag})}, 51000);
setTimeout(() => {a({body: " তর আম্মুর উপ্তা কইরা চুদা দিমু।😈❤" + " " + name, mentions: arraytag})}, 54000);
setTimeout(() => {a({body: " তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু।😈💋" + " " + name, mentions: arraytag})}, 57000);
setTimeout(() => {a("~ রোমিও এর পুত। যা ভাগ🤖😈💋")} , 59000);


  
  }
